In [ ]:
# PRAC 1 : Extract the data from database using python and demonstrate various data pre-processing techniques for a given dataset
# NAME : SHUBHAM SONAKE
# REG NO : 2021BIT047

In [ ]:
# installing required libraries

In [4]:
%matplotlib inline
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn

In [5]:
dataset = pd.read_csv(r"Data.csv")

In [6]:
df = pd.DataFrame(dataset)

In [7]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [8]:
X = df.iloc[:, :-1].values
y = df.iloc[:, -1].values

In [9]:
print(X)

[['France' 44.0 72000.0]
 ['Spain' 27.0 48000.0]
 ['Germany' 30.0 54000.0]
 ['Spain' 38.0 61000.0]
 ['Germany' 40.0 nan]
 ['France' 35.0 58000.0]
 ['Spain' nan 52000.0]
 ['France' 48.0 79000.0]
 ['Germany' 50.0 83000.0]
 ['France' 37.0 67000.0]]

In [10]:
print(y)

['No' 'Yes' 'No' 'No' 'Yes' 'Yes' 'No' 'Yes' 'No' 'Yes']

In [ ]:
#Identifying and handling the missing values

In [11]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [ ]:
# solution using  Dropna

In [12]:
df1 = df.copy()

In [13]:
# summarize the shape of the raw data
print("Before:",df1.shape)

# drop rows with missing values
df1.dropna(inplace=True)

# summarize the shape of the data with missing rows removed
print("After:",df1.shape)

Before: (10, 4)
After: (8, 4)

In [ ]:
# Checking for missing values

In [14]:
print("Isnull:")
print(df.isnull())

Isnull:
   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [15]:
print("\nNotnull:")
print(df.notnull())

Notnull:
   Country    Age  Salary  Purchased
0     True   True    True       True
1     True   True    True       True
2     True   True    True       True
3     True   True    True       True
4     True   True   False       True
5     True   True    True       True
6     True  False    True       True
7     True   True    True       True
8     True   True    True       True
9     True   True    True       True

In [ ]:
# Dropping rows with missing values

In [16]:
df_dropna = df.dropna()
print("\nDropna:")
print(df_dropna)

Dropna:
   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [ ]:
# Filling missing values with a specified value

In [17]:
df_fillna = df.fillna(0)
print("\nFillna:")
print(df_fillna)

Fillna:
   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      0.0       Yes
5   France  35.0  58000.0       Yes
6    Spain   0.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [ ]:
# Replacing values

In [18]:
df_replace = df.replace({'Yes': 1, 'No': 0})
print("\nReplace:")
print(df_replace)

Replace:
   Country   Age   Salary  Purchased
0   France  44.0  72000.0          0
1    Spain  27.0  48000.0          1
2  Germany  30.0  54000.0          0
3    Spain  38.0  61000.0          0
4  Germany  40.0      NaN          1
5   France  35.0  58000.0          1
6    Spain   NaN  52000.0          0
7   France  48.0  79000.0          1
8  Germany  50.0  83000.0          0
9   France  37.0  67000.0          1

In [ ]:
# Interpolating missing values

In [21]:
df_interpolate = df.interpolate()
print("\nInterpolate:")
print(df_interpolate)

Interpolate:
   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  59500.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  41.5  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

C:\Users\vsona\AppData\Local\Temp\ipykernel_3220\1072513874.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df_interpolate = df.interpolate()

In [ ]:
# Creating a boolean series for NaN values

In [22]:
nan_bool_series = df.isnull()
print("\nBoolean Series for NaN values:")
print(nan_bool_series)

Boolean Series for NaN values:
   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [ ]:
# Filtering data based on conditions

In [23]:
filtered_data = df[df['Age'] > 30]
print("\nFiltered Data:")
print(filtered_data)

Filtered Data:
   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [ ]:
# Creating a dictionary of lists

In [24]:
new_data = {
    'Country': ['Italy', 'France'],
    'Age': [32.0, 41.0],
    'Salary': [60000.0, np.nan],
    'Purchased': ['Yes', 'No']
}

In [ ]:
# after creating dictionary of lists

In [26]:
print(new_data)

{'Country': ['Italy', 'France'], 'Age': [32.0, 41.0], 'Salary': [60000.0, nan], 'Purchased': ['Yes', 'No']}

In [ ]:
# Creating a new DataFrame using the dictionary

In [27]:
new_df = pd.DataFrame(new_data)

In [28]:
print(new_df)

  Country   Age   Salary Purchased
0   Italy  32.0  60000.0       Yes
1  France  41.0      NaN        No

In [ ]:
# Concatenating DataFrames

In [29]:
concatenated_df = pd.concat([df, new_df], ignore_index=True)
print("\nConcatenated DataFrame:")
print(concatenated_df)

Concatenated DataFrame:
    Country   Age   Salary Purchased
0    France  44.0  72000.0        No
1     Spain  27.0  48000.0       Yes
2   Germany  30.0  54000.0        No
3     Spain  38.0  61000.0        No
4   Germany  40.0      NaN       Yes
5    France  35.0  58000.0       Yes
6     Spain   NaN  52000.0        No
7    France  48.0  79000.0       Yes
8   Germany  50.0  83000.0        No
9    France  37.0  67000.0       Yes
10    Italy  32.0  60000.0       Yes
11   France  41.0      NaN        No

In [ ]:
# Filling missing values using notnull() function

In [30]:
df_filled = df[df['Salary'].notnull()]
print("\nFilled Missing Values:")
print(df_filled)

Filled Missing Values:
   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes